import { ItemProps } from "@/types/item";

export const items = [
  {
    id: 1,
    image: "../../assets/img/Safari (Catalina) - Dark 1.png",
    section: "Front-end",
    period: 1,
    likes: 4,
    title: "Как работать с CSS Grid",
    hrefText: "Грид-раскладка (CSS Grid Layout)",
    href: "https://developer.mozilla.org/ru/docs/Web/CSS/CSS_Grid_Layout",
    article:
      "представляет собой двумерную систему сеток в CSS. Гриды подойдут и для верстки основных областей страницы, и небольших элементов пользовательского интерфейса. Эта статья даёт общее представление о грид-раскладке и новой терминологии, которая является частью спецификации CSS Grid Layout Level 1. Более подробно показанные возможности будут описаны описаны далее в руководстве.",
    subtitle: "Что такое грид?",
    subarticle:
      "Грид представляет собой пересекающийся набор горизонтальных и вертикальных линий, образующих колонки и строки. Элементы могут быть помещены в грид в пределах линий этих колонок и строк. Грид имеет следующие особенности:",
    time: 1,
  },
  {
    id: 2,
    image: "../../assets/img/Safari (Catalina) - Dark 1.png",
    section: "Front-end",
    period: 1,
    likes: 4,
    title: "Как работать с CSS Grid",
    hrefText: "Грид-раскладка (CSS Grid Layout)",
    href: "https://developer.mozilla.org/ru/docs/Web/CSS/CSS_Grid_Layout",

    article:
      "представляет собой двумерную систему сеток в CSS. Гриды подойдут и для верстки основных областей страницы, и небольших элементов пользовательского интерфейса. Эта статья даёт общее представление о грид-раскладке и новой терминологии, которая является частью спецификации CSS Grid Layout Level 1. Более подробно показанные возможности будут описаны описаны далее в руководстве.",
    subtitle: "Что такое грид?",
    subarticle:
      "Грид представляет собой пересекающийся набор горизонтальных и вертикальных линий, образующих колонки и строки. Элементы могут быть помещены в грид в пределах линий этих колонок и строк. Грид имеет следующие особенности:",
    time: 1,
  },
  {
    id: 3,
    image: "../../assets/img/Safari (Catalina) - Dark 1.png",
    section: "Front-end",
    period: 1,
    likes: 4,
    title: "Как работать с CSS Grid",
    hrefText: "Грид-раскладка (CSS Grid Layout)",
    href: "https://developer.mozilla.org/ru/docs/Web/CSS/CSS_Grid_Layout",

    article:
      "представляет собой двумерную систему сеток в CSS. Гриды подойдут и для верстки основных областей страницы, и небольших элементов пользовательского интерфейса. Эта статья даёт общее представление о грид-раскладке и новой терминологии, которая является частью спецификации CSS Grid Layout Level 1. Более подробно показанные возможности будут описаны описаны далее в руководстве.",
    subtitle: "Что такое грид?",
    subarticle:
      "Грид представляет собой пересекающийся набор горизонтальных и вертикальных линий, образующих колонки и строки. Элементы могут быть помещены в грид в пределах линий этих колонок и строк. Грид имеет следующие особенности:",
    time: 1,
  },
] as ItemProps[];